examples/acc_unv_192_168_1_104/media2/GetStreamUri.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
	xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
	xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
	xmlns:tt="http://www.onvif.org/ver10/schema"
	xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
	xmlns:tr2="http://www.onvif.org/ver20/media/wsdl"
	xmlns:wsa5="http://www.w3.org/2005/08/addressing">
	<SOAP-ENV:Header>
		<wsse:Security SOAP-ENV:mustUnderstand="true">
			<wsse:UsernameToken>
				<wsse:Username>admin</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">BeK9Gp0qOhokPoChnsVSBMN+WMw=</wsse:Password>
				<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">E3Read9Z5GzZ9eXBrx4FP2s47IY=</wsse:Nonce>
				<wsu:Created>2026-01-07T14:56:19Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<tr2:GetStreamUri>
			<tr2:Protocol>RTSP</tr2:Protocol>
			<tr2:ProfileToken>media_profile1</tr2:ProfileToken>
		</tr2:GetStreamUri>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>